app/controllers/admin/categories_controller.rb

  def index
    @categories_grid = initialize_grid(Category.where(parent_id: 0).order(:seq))
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = $1  ORDER BY "categories"."seq" ASC  [["parent_id", 1]]

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("caption", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "男裝"], ["description", ""], ["created_at", "2016-07-11 05:16:02.979444"], ["updated_at", "2016-07-11 05:16:02.979444"]]

  def set_record
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]