app/controllers/admin/store_infos_controller.rb

INSERT INTO "store_infos" ("caption", "phone", "address", "content", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @storeInfo = StoreInfo.new(storeInfo_params)
    if @storeInfo.save

SELECT  "store_infos".* FROM "store_infos" WHERE "store_infos"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_record
    @storeInfo = StoreInfo.find(params[:id])